--- src/health.rs
+++ replace accept_loop with ()
@@ -133,60 +133,17 @@
 /// s'arrête proprement sur signal d'arrêt, erreur persistante ou listener
 /// fermé.
 fn accept_loop(
     listener: TcpListener,
     metrics: Arc<NodeMetrics>,
     active: Arc<AtomicUsize>,
     stop_flag: Arc<AtomicBool>,
 ) {
-    let mut consecutive_errors: u32 = 0;
-    loop {
-        if stop_flag.load(Ordering::Acquire) {
-            break clean_stop();
-        }
-        match listener.accept() {
-            Ok((stream, _peer)) => {
-                consecutive_errors = 0;
-                if active.load(Ordering::Relaxed) >= MAX_CONCURRENT_CONNECTIONS {
-                    // Surchargé (impossible en pratique sur localhost) :
-                    // refus explicite servi inline, aucun thread spawned.
-                    serve_inline_busy(stream);
-                    continue;
-                }
-                let m = metrics.clone();
-                let a = active.clone();
-                let spawned = std::thread::Builder::new()
-                    .name("onde-health-conn".to_string())
-                    .spawn(move || {
-                        a.fetch_add(1, Ordering::Relaxed);
-                        handle_connection(stream, &m);
-                        a.fetch_sub(1, Ordering::Relaxed);
-                    });
-                if spawned.is_err() {
-                    // Épuisement de threads OS : on ignore cette connexion
-                    // (le client retentera) sans jamais paniquer.
-                    continue;
-                }
-            }
-            Err(e) => {
-                if stop_flag.load(Ordering::Acquire) {
-                    break clean_stop();
-                }
-                consecutive_errors += 1;
-                tracing::warn!("event=health_accept_error count={consecutive_errors} error={e}");
-                if consecutive_errors >= MAX_CONSECUTIVE_ACCEPT_ERRORS {
-                    tracing::error!(
-                        "event=health_listener_died consecutive_errors={consecutive_errors}"
-                    );
-                    return;
-                }
-            }
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Arrêt propre de la boucle d'acceptation (log structuré unique).
 fn clean_stop() {
     tracing::info!("event=health_stopped reason=shutdown");
 }
 
 /// Réponse 503 servie inline quand le plafond de connexions est atteint.
