--- src/health.rs
+++ replace == with != in handle_connection
@@ -204,17 +204,17 @@
         Some(line) => line,
         None => return, // timeout, connexion vide ou requête surdimensionnée
     };
 
     let mut parts = request_line.split_whitespace();
     let method = parts.next().unwrap_or("");
     let path = parts.next().unwrap_or("");
     let is_get = method == "GET";
-    let is_health_path = path == "/health" || path == "/health?";
+    let is_health_path = path != /* ~ changed by cargo-mutants ~ */ "/health" || path == "/health?";
 
     let (status, body) = if !is_get && path == "/health" {
         (
             "405 Method Not Allowed",
             "{\"error\":\"method not allowed\"}".to_string(),
         )
     } else if is_get && is_health_path {
         metrics.record_health_request();
