--- src/health.rs
+++ delete ! in handle_connection
@@ -206,17 +206,17 @@
     };
 
     let mut parts = request_line.split_whitespace();
     let method = parts.next().unwrap_or("");
     let path = parts.next().unwrap_or("");
     let is_get = method == "GET";
     let is_health_path = path == "/health" || path == "/health?";
 
-    let (status, body) = if !is_get && path == "/health" {
+    let (status, body) = if  /* ~ changed by cargo-mutants ~ */is_get && path == "/health" {
         (
             "405 Method Not Allowed",
             "{\"error\":\"method not allowed\"}".to_string(),
         )
     } else if is_get && is_health_path {
         metrics.record_health_request();
         let body = metrics.snapshot_json();
         tracing::debug!(
