--- src/health.rs
+++ replace find_crlf -> Option<usize> with None
@@ -256,17 +256,17 @@
             }
             Err(_) => return None, // timeout lecture (> SOCKET_TIMEOUT)
         }
     }
 }
 
 /// Position du premier `\r\n` dans `buf`, si présent.
 fn find_crlf(buf: &[u8]) -> Option<usize> {
-    buf.windows(2).position(|w| w == b"\r\n")
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Écrit une réponse HTTP/1.1 minimale JSON + `Connection: close`.
 fn write_response(stream: &mut TcpStream, status: &str, body: &str) -> std::io::Result<()> {
     let response = format!(
         "HTTP/1.1 {status}\r\nContent-Type: application/json\r\nContent-Length: {}\r\nConnection: close\r\n\r\n{body}",
         body.len()
     );
