--- src/health.rs
+++ replace HealthHandle::shutdown with ()
@@ -75,17 +75,17 @@
     /// réveiller `accept()`.
     thread_listener: Option<TcpListener>,
 }
 
 impl HealthHandle {
     /// Arrêt propre : ferme le listener et signale la boucle d'acceptation.
     /// Les requêtes déjà acceptées se terminent seules (timeouts bornés).
     pub fn shutdown(mut self) {
-        self.stop_internal();
+        () /* ~ changed by cargo-mutants ~ */
         // `self.thread_listener` est fermée par `stop_internal`.
     }
 
     fn stop_internal(&mut self) {
         self.stop_flag.store(true, Ordering::Release);
         // Fermer le clone du listener réveille immédiatement un accept()
         // bloquant dans le thread serveur.
         self.thread_listener = None;
