--- src/health.rs
+++ replace <impl Drop for HealthHandle>::drop with ()
@@ -89,17 +89,17 @@
         // Fermer le clone du listener réveille immédiatement un accept()
         // bloquant dans le thread serveur.
         self.thread_listener = None;
     }
 }
 
 impl Drop for HealthHandle {
     fn drop(&mut self) {
-        self.stop_internal();
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Démarre le serveur de santé lié à `127.0.0.1:port`.
 ///
 /// `port = 0` → bind éphémère choisi par l'OS ; le port effectif est exposé
 /// par [`HealthHandle::port`]. Le thread d'acceptation est détaché (le nœud
 /// n'a pas à attendre sa fin) mais reste propre : erreurs persistantes ou
