--- src/metrics.rs
+++ replace unix_now -> u64 with 1
@@ -34,20 +34,17 @@
 //! let json = metrics.snapshot_json();
 //! assert!(json.contains("\"status\":\"ok\""));
 //! ```
 use std::sync::atomic::{AtomicU64, Ordering};
 use std::time::{SystemTime, UNIX_EPOCH};
 
 /// Instant unix courant en secondes (0 si l'horloge système est invalide).
 fn unix_now() -> u64 {
-    SystemTime::now()
-        .duration_since(UNIX_EPOCH)
-        .map(|d| d.as_secs())
-        .unwrap_or(0)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Soustraction **saturante** lock-free sur une jauge atomique : ne descend
 /// jamais sous 0 (les purges concurrentes avec des ajouts restent cohérentes).
 fn saturating_sub(counter: &AtomicU64, value: u64) {
     let mut current = counter.load(Ordering::Relaxed);
     loop {
         let next = current.saturating_sub(value);
