--- src/health.rs
+++ replace >= with < in accept_loop
@@ -205,17 +205,17 @@
                 std::thread::sleep(ACCEPT_POLL_INTERVAL);
             }
             Err(e) => {
                 if stop_flag.load(Ordering::Acquire) {
                     break clean_stop();
                 }
                 consecutive_errors += 1;
                 tracing::warn!("event=health_accept_error count={consecutive_errors} error={e}");
-                if consecutive_errors >= MAX_CONSECUTIVE_ACCEPT_ERRORS {
+                if consecutive_errors < /* ~ changed by cargo-mutants ~ */ MAX_CONSECUTIVE_ACCEPT_ERRORS {
                     tracing::error!(
                         "event=health_listener_died consecutive_errors={consecutive_errors}"
                     );
                     return;
                 }
                 std::thread::sleep(ACCEPT_POLL_INTERVAL);
             }
         }
