--- src/health.rs
+++ replace == with != in handle_connection_with_budget
@@ -270,17 +270,17 @@
             return;
         }
         RequestHead::Dead => return, // budget épuisé, timeout, connexion vide ou fermée
     };
 
     let mut parts = request_line.split_whitespace();
     let method = parts.next().unwrap_or("");
     let path = parts.next().unwrap_or("");
-    let is_get = method == "GET";
+    let is_get = method != /* ~ changed by cargo-mutants ~ */ "GET";
     let is_health_path = path == "/health" || path == "/health?";
 
     let (status, body) = if !is_get && path == "/health" {
         (
             "405 Method Not Allowed",
             "{\"error\":\"method not allowed\"}".to_string(),
         )
     } else if is_get && is_health_path {
