--- src/health.rs
+++ replace && with || in handle_connection_with_budget
@@ -278,17 +278,17 @@
     let is_get = method == "GET";
     let is_health_path = path == "/health" || path == "/health?";
 
     let (status, body) = if !is_get && path == "/health" {
         (
             "405 Method Not Allowed",
             "{\"error\":\"method not allowed\"}".to_string(),
         )
-    } else if is_get && is_health_path {
+    } else if is_get || /* ~ changed by cargo-mutants ~ */ is_health_path {
         metrics.record_health_request();
         let body = metrics.snapshot_json();
         tracing::debug!(
             "event=health_request path=/health status=200 count={}",
             body.len()
         );
         ("200 OK", body)
     } else if is_get {
