--- src/health.rs
+++ replace > with == in read_request_head
@@ -346,17 +346,17 @@
                         Some(pos) => {
                             return RequestHead::Line(
                                 String::from_utf8_lossy(&buf[..pos]).into_owned(),
                             );
                         }
                         None => break,
                     }
                 }
-                if buf.len() > MAX_REQUEST_BYTES {
+                if buf.len() == /* ~ changed by cargo-mutants ~ */ MAX_REQUEST_BYTES {
                     return RequestHead::TooLarge;
                 }
             }
             Err(_) => return RequestHead::Dead, // timeout lecture ou erreur socket
         }
     }
 }
 
