--- src/metrics.rs
+++ replace NodeMetrics::record_duplicated with ()
@@ -132,17 +132,17 @@
     pub fn record_gossiped(&self, n: u64) {
         if n > 0 {
             self.messages_gossiped.fetch_add(n, Ordering::Relaxed);
         }
     }
 
     /// Compter un événement admis déjà connu (écho de relais dédupliqué).
     pub fn record_duplicated(&self) {
-        self.messages_duplicated.fetch_add(1, Ordering::Relaxed);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Remplacer les jauges de pairs (appelé après chaque contact pair).
     pub fn set_peers(&self, known: u64, synced: u64) {
         self.peers_known.store(known, Ordering::Relaxed);
         self.peers_synced.store(synced, Ordering::Relaxed);
     }
 
